MASK1 = 2**32 
MASK2 = 2**31 
MASK3 = 2**31-1 
# MASK1 = 2³²：用于模运算，把数字限制在 32 位无符号整数范围内（0 ~ 2³²-1）
# MASK2 = 2³¹：即 10000...0（32位），用来检测符号位（最高位）是否为 1
# MASK3 = 2³¹-1：即 01111...1（32位），低31位全1，用于辅助负数还原

class Solution:
    def getSum(self, a: int, b: int) -> int:
        # 01, 10 -> 11
        # 10, 11 ->101
        # 无进位：1 | 0 -> 1
        # 进位：1 & 1 -> 10
        # 把 a,b（以及中间结果）限制到 32 位，
        # 否则在 Python 里负数的位运算会“无限扩展符号位”，可能导致循环不收敛或结果不符合 32 位规则。

        #统一转为 32 位无符号数
        a %= MASK1
        b %= MASK1

        while b != 0: #只要还有进位，就继续循环。
            carry = ((a & b)<<1) % MASK1
            #a & b：找出所有同为1的位，即会产生进位的位
            #<< 1：进位要往高位移动一位
            #% MASK1：防止溢出 32 位
            a = (a^b) % MASK1
            #a ^ b：不考虑进位的加法（相同位抵消，不同位保留）
            # 新的当前和赋值给a
            b = carry
            #进位后给b

        if a & MASK2: #检查符号位（第31位）是否为1：如果是负数
            return ~((a^MASK2)^MASK3)
                #1. a ^ MASK2把符号位清零，得到低31位数值
                #2. ^ MASK3低31位全部取反（按位异或全1）
                #3. ~(...)Python 按位取反，等效于加负号再减1
                # 在前面的操作中，我们把负数转为补码格式
                # 现在还原为 Python 负整数。
        else:
            return a 